let allData = [
  {
    "date": "20251126",
    "title": "人体微观探秘：从“眼睑震颤”到“炎症印记”的生命机制浅析",
    "tags": [
      "生命"
    ],
    "pdf": "deepchat/20251126-人体微观探秘：从“眼睑震颤”到“炎症印记”的生命机制浅析-生命.pdf"
  },
  {
    "date": "20251125",
    "title": "当你入睡，大脑的“造梦工厂”悄悄开工了",
    "tags": [
      "神经学"
    ],
    "pdf": "deepchat/20251125-当你入睡，大脑的“造梦工厂”悄悄开工了-神经学.pdf"
  },
  {
    "date": "20251124",
    "title": "系统、熵增与韧性：从“鞋带散开”到我们的科研实践",
    "tags": [
      "生活_物理",
      "人生"
    ],
    "pdf": "deepchat/20251124-系统、熵增与韧性：从“鞋带散开”到我们的科研实践-生活_物理,人生.pdf"
  },
  {
    "date": "20251121",
    "title": "当你意识到生命只有一次时，第二次生命就开始了",
    "tags": [
      "人生"
    ],
    "pdf": "deepchat/20251121-当你意识到生命只有一次时，第二次生命就开始了-人生.pdf"
  },
  {
    "date": "20251120",
    "title": "当机器学会“做人”：我们为什么执着于造一个“自己”？",
    "tags": [
      "人工智能",
      "人生"
    ],
    "pdf": "deepchat/20251120-当机器学会“做人”：我们为什么执着于造一个“自己”？-人工智能,人生.pdf"
  },
  {
    "date": "20251119",
    "title": "炒菜的魅力与中西烹饪差异",
    "tags": [
      "生活",
      "表征"
    ],
    "pdf": "deepchat/20251119-炒菜的魅力与中西烹饪差异-生活,表征.pdf"
  },
  {
    "date": "20251118",
    "title": "从“吸管现象”到“干槽症风险”：一次关于压力差的物理学小讨论",
    "tags": [
      "生活",
      "物理"
    ],
    "pdf": "deepchat/20251118-从“吸管现象”到“干槽症风险”：一次关于压力差的物理学小讨论-生活,物理.pdf"
  },
  {
    "date": "20251117",
    "title": "厚衣服不等于暖？冬季穿搭的科学秘密",
    "tags": [
      "生活",
      "物理"
    ],
    "pdf": "deepchat/20251117-厚衣服不等于暖？冬季穿搭的科学秘密-生活,物理.pdf"
  },
  {
    "date": "20251114",
    "title": "从一杯“瑞之抹茶”，聊聊我们的身体：水重、清醒与清晨的浮肿",
    "tags": [
      "健康",
      "生命"
    ],
    "pdf": "deepchat/20251114-从一杯“瑞之抹茶”，聊聊我们的身体：水重、清醒与清晨的浮肿-健康,生命.pdf"
  }
];